# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "domt4/autoupdate"


# Update 31 July 2023
brew "ack"
brew "adns"
brew "antibody"
brew "aom"
brew "apr"
brew "apr-util"
brew "argon2"
brew "asdf"
brew "aspell"
brew "autoconf"
brew "automake"
brew "aws-sam-cli"
brew "bash"
brew "bat"
brew "bdw-gc"
brew "binaryen"
brew "boost"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "cairo"
brew "carthage"
brew "cffi"
brew "checkov"
brew "cmake"
brew "composer"
brew "consul-template"
brew "contentful-cli"
brew "coreutils"
brew "curl"
brew "curl-openssl"
brew "diff-so-fancy"
brew "docutils"
brew "double-conversion"
brew "edencommon"
brew "emscripten"
brew "fb303"
brew "fbthrift"
brew "fizz"
brew "fmt"
brew "folly"
brew "fontconfig"
brew "freetds"
brew "freetype"
brew "fzf"
brew "gcc"
brew "gd"
brew "gdbm"
brew "gettext"
brew "gflags"
brew "giflib"
brew "git"
brew "git-lfs"
brew "glib"
brew "glog"
brew "gmp"
brew "gnupg"
brew "gnutls"
brew "go"
brew "golangci-lint"
brew "graphite2"
brew "grep"
brew "guile"
brew "harfbuzz"
brew "hcledit"
brew "highway"
brew "hstr"
brew "httpie"
brew "icu4c"
brew "imath"
brew "infracost"
brew "isl"
brew "jansson"
brew "jemalloc"
brew "jpeg"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jq"
brew "krb5"
brew "less"
brew "libassuan"
brew "libavif"
brew "libcbor"
brew "libev"
brew "libevent"
brew "libffi"
brew "libfido2"
brew "libgcrypt"
brew "libgpg-error"
brew "libidn"
brew "libidn2"
brew "libksba"
brew "libmetalink"
brew "libmpc"
brew "libnghttp2"
brew "libomp"
brew "libpng"
brew "libpq"
brew "libpthread-stubs"
brew "libpython-tabulate"
brew "libsodium"
brew "libssh2"
brew "libtasn1"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libusb"
brew "libuv"
brew "libvmaf"
brew "libvterm"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxml2"
brew "libxrender"
brew "libxslt"
brew "libyaml"
brew "libzip"
brew "little-cms2"
brew "llvm"
brew "localstack"
brew "lua"
brew "luajit"
brew "luajit-openresty"
brew "luarocks"
brew "luv"
brew "lz4"
brew "lzo"
brew "m4"
brew "macos-term-size"
brew "mas"
brew "mongosh"
brew "mpdecimal"
brew "mpfr"
brew "msgpack"
brew "mysql"
brew "nano"
brew "ncurses"
brew "neovim"
brew "nettle"
brew "nghttp2"
brew "node"
brew "node@12"
brew "node@14"
brew "node@16"
brew "npth"
brew "oniguruma"
brew "openexr"
brew "openjdk"
brew "openldap"
brew "openssl@1.1"
brew "openssl@3"
brew "p11-kit"
brew "pcre"
brew "pcre2"
brew "pinentry"
brew "pixman"
brew "pkg-config"
brew "popt"
brew "postgresql@14"
brew "pre-commit"
brew "protobuf"
brew "pycparser"
brew "pygments"
brew "python-tabulate"
brew "python-typing-extensions"
brew "python@3.11"
brew "pyyaml"
brew "readline"
brew "reattach-to-user-namespace"
brew "rsync"
brew "rtmpdump"
brew "ruby"
brew "shellcheck"
brew "shopify-cli"
brew "six"
brew "snappy"
brew "sqlite"
brew "sshpass"
brew "tcl-tk"
brew "telnet"
brew "terraform"
brew "terraform-docs"
brew "terrascan"
brew "tflint"
brew "tfsec"
brew "tfswitch"
brew "tfupdate"
brew "the_silver_searcher"
brew "thefuck"
brew "tidy-html5"
brew "tig"
brew "tmux"
brew "trash"
brew "tree"
brew "tree-sitter"
brew "unbound"
brew "unibilium"
brew "unixodbc"
brew "utf8proc"
brew "vault"
brew "virtualenv"
brew "wangle"
brew "watch"
brew "watchman"
brew "webp"
brew "wget"
brew "wxmac"
brew "wxwidgets"
brew "xorgproto"
brew "xxhash"
brew "xz"
brew "yarn"
brew "yor"
brew "yuicompressor"
brew "z3"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "zstd"


# Java spring boot
# brew spring-io/tap
# cask spring-io/tap
tap "spring-io/tap"
brew "spring-boot"
brew "gradle"
brew "maven"


# GitHub
brew "hub"
brew "gh"


# AWS
brew "awscli"


# Fonts
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-fira-code"
cask "font-hasklig"


# GCP
cask "google-cloud-sdk"



# Apps and Extensions
cask "alfred"
cask "aws-vault"
cask "dash"
cask "dbeaver-community"
cask "docker"
cask "github"
cask "grammarly"
cask "insomnia"
cask "macdown"
cask "paw"
cask "redis-stack"
cask "redis-stack-redisinsight"
cask "redis-stack-server"
cask "tableplus"
cask "tunnelblick"
cask "visual-studio-code"

# vscode extensions
code --install-extension abusaidm.html-snippets
code --install-extension adpyke.codesnap
code --install-extension adpyke.vscode-sql-formatter
code --install-extension alexkrechik.cucumberautocomplete
code --install-extension amazonwebservices.aws-toolkit-vscode
code --install-extension apollographql.vscode-apollo
code --install-extension bierner.markdown-mermaid
code --install-extension cschlosser.doxdocgen
code --install-extension cweijan.vscode-mysql-client2
code --install-extension dbaeumer.vscode-eslint
code --install-extension donjayamanne.githistory
code --install-extension dsznajder.es7-react-js-snippets
code --install-extension eamodio.gitlens
code --install-extension ecmel.vscode-html-css
code --install-extension EditorConfig.EditorConfig
code --install-extension Equinusocio.vsc-community-material-theme
code --install-extension Equinusocio.vsc-material-theme
code --install-extension equinusocio.vsc-material-theme-icons
code --install-extension esbenp.prettier-vscode
code --install-extension formulahendry.auto-close-tag
code --install-extension formulahendry.auto-rename-tag
code --install-extension formulahendry.vscode-mysql
code --install-extension genieai.chatgpt-vscode
code --install-extension GitHub.vscode-pull-request-github
code --install-extension golang.go
code --install-extension GraphQL.vscode-graphql
code --install-extension GraphQL.vscode-graphql-syntax
code --install-extension hashicorp.terraform
code --install-extension HookyQR.beautify
code --install-extension jcbuisson.vue
code --install-extension jebbs.plantuml
code --install-extension jeff-hykin.better-cpp-syntax
code --install-extension josetr.cmake-language-support-vscode
code --install-extension maracko.json-to-go
code --install-extension mikestead.dotenv
code --install-extension ms-azuretools.vscode-docker
code --install-extension ms-dotnettools.vscode-dotnet-runtime
code --install-extension ms-python.isort
code --install-extension ms-python.python
code --install-extension ms-python.vscode-pylance
code --install-extension ms-toolsai.jupyter
code --install-extension ms-toolsai.jupyter-keymap
code --install-extension ms-toolsai.jupyter-renderers
code --install-extension ms-toolsai.vscode-jupyter-cell-tags
code --install-extension ms-toolsai.vscode-jupyter-slideshow
code --install-extension ms-vscode-remote.remote-containers
code --install-extension ms-vscode-remote.remote-ssh
code --install-extension ms-vscode-remote.remote-ssh-edit
code --install-extension ms-vscode-remote.remote-wsl
code --install-extension ms-vscode.cmake-tools
code --install-extension ms-vscode.cpptools
code --install-extension ms-vscode.cpptools-extension-pack
code --install-extension ms-vscode.cpptools-themes
code --install-extension ms-vscode.remote-explorer
code --install-extension msjsdiag.debugger-for-chrome
code --install-extension mtxr.sqltools
code --install-extension Orta.vscode-jest
code --install-extension PKief.material-icon-theme
code --install-extension pranaygp.vscode-css-peek
code --install-extension Prisma.prisma
code --install-extension Quernest.prisma
code --install-extension redhat.java
code --install-extension redhat.vscode-yaml
code --install-extension ritwickdey.LiveServer
code --install-extension shrey150.javafx-support
code --install-extension SonarSource.sonarlint-vscode
code --install-extension stylelint.vscode-stylelint
code --install-extension twxs.cmake
code --install-extension usernamehw.errorlens
code --install-extension VisualStudioExptTeam.intellicode-api-usage-examples
code --install-extension VisualStudioExptTeam.vscodeintellicode
code --install-extension vmware.vscode-boot-dev-pack
code --install-extension vmware.vscode-spring-boot
code --install-extension vscjava.vscode-java-debug
code --install-extension vscjava.vscode-java-dependency
code --install-extension vscjava.vscode-java-pack
code --install-extension vscjava.vscode-java-test
code --install-extension vscjava.vscode-maven
code --install-extension vscjava.vscode-spring-boot-dashboard
code --install-extension vscjava.vscode-spring-initializr
code --install-extension wayou.vscode-todo-highlight
code --install-extension xabikos.JavaScriptSnippets
code --install-extension yzhang.markdown-all-in-one
code --install-extension Zignd.html-css-class-completion
